bench/bench.txt
wrk -t4 -c100 -d10 -L
nginx 
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   580.03us  360.12us  23.30ms   98.54%
    Req/Sec    44.07k     3.32k   64.85k    78.91%
  Latency Distribution
     50%  553.00us
     75%  626.00us
     90%  710.00us
     99%    1.00ms
  1766891 requests in 10.10s, 350.48MB read
Requests/sec: 174940.48
Transfer/sec:     34.70MB

ezNet
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   568.54us  126.90us   3.99ms   73.82%
    Req/Sec    43.90k     2.44k   51.88k    66.58%
  Latency Distribution
     50%  557.00us
     75%  636.00us
     90%  722.00us
     99%    0.92ms
  1764047 requests in 10.10s, 156.46MB read
Requests/sec: 174661.30
Transfer/sec:     15.49MB


wrk -t4 -c500 -d10 -L
nginx
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.57ms   37.91ms 661.71ms   97.84%
    Req/Sec    43.85k     7.74k  121.42k    95.00%
  Latency Distribution
     50%    2.79ms
     75%    3.04ms
     90%    3.34ms
     99%  195.58ms
  1745561 requests in 10.03s, 346.25MB read
Requests/sec: 174028.67
Transfer/sec:     34.52MB

ezNet
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.01ms  433.39us  10.54ms   74.21%
    Req/Sec    41.72k     3.50k   53.10k    73.00%
  Latency Distribution
     50%    2.98ms
     75%    3.24ms
     90%    3.52ms
     99%    4.12ms
  1660486 requests in 10.03s, 147.27MB read
Requests/sec: 165472.47
Transfer/sec:     14.68MB