bench/bench.txt
wrk -t4 -c100 -d10 -L
nginx 
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   709.05us  492.09us  28.92ms   99.11%
    Req/Sec    36.24k     2.67k   43.84k    69.55%
  Latency Distribution
     50%  676.00us
     75%  749.00us
     90%  830.00us
     99%    1.15ms
  1456646 requests in 10.10s, 288.94MB read
Requests/sec: 144219.29
Transfer/sec:     28.61MB

ezNet
 4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   574.23us  137.09us   2.18ms   74.21%
    Req/Sec    43.45k     2.75k   50.12k    64.36%
  Latency Distribution
     50%  561.00us
     75%  643.00us
     90%  741.00us
     99%    0.99ms
  1746466 requests in 10.10s, 154.90MB read
Requests/sec: 172920.18
Transfer/sec:     15.34MB


wrk -t4 -c500 -d10 -L
nginx
 4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.64ms   47.28ms 769.84ms   97.71%
    Req/Sec    36.88k     5.84k   78.11k    91.96%
  Latency Distribution
     50%    3.35ms
     75%    3.63ms
     90%    3.96ms
     99%  264.18ms
  1460928 requests in 10.02s, 289.79MB read
Requests/sec: 145838.87
Transfer/sec:     28.93MB

ezNet
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.92ms  384.11us   6.94ms   73.92%
    Req/Sec    43.02k     2.95k   52.28k    78.50%
  Latency Distribution
     50%    2.89ms
     75%    3.12ms
     90%    3.36ms
     99%    4.01ms
  1711308 requests in 10.02s, 151.78MB read
Requests/sec: 170862.75
Transfer/sec:     15.15MB